ERP.belugaerp/src/Documents/ОрдерНаОтражениеИзлишковТоваров/ОрдерНаОтражениеИзлишковТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОрдерНаОтражениеИзлишковТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ДокументОснование</name>
    <type>
      <types>DocumentRef.КорректировкаРеализации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/КорректировкаРеализации/КорректировкаРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КорректировкаРеализации</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_КодыСтрокБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расхождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_СкидкиНаценки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/ОрдерНаОтражениеИзлишковТоваров/ObjectModule.bsl
#Область ОбработчикиСобытий

&Перед("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	ЗаполненНаОснованииДокумента = Ложь;
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.КорректировкаРеализации") Тогда

		ЗаполнитьДокументНаОснованииКорректировкиРеализации(ДанныеЗаполнения);
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииКорректировкиРеализации(Знач ДокументОснование)
	
	Склад = ДокументОснование.Склад;
	бг_ДокументОснование = ДокументОснование;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ДокументОснование);
	Запрос.УстановитьПараметр("Склад", ДокументОснование.Склад);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКОформлениюИзлишков.Регистратор КАК Регистратор,
	|	ТоварыКОформлениюИзлишков.Склад КАК Склад,
	|	ТоварыКОформлениюИзлишков.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюИзлишков.Характеристика КАК Характеристика,
	|	ТоварыКОформлениюИзлишков.Назначение КАК Назначение,
	|	ТоварыКОформлениюИзлишков.Серия КАК Серия,
	|	ТоварыКОформлениюИзлишков.КОформлениюАктовРасход КАК КОформлениюАктовРасход
	|ПОМЕСТИТЬ ТоварыКОформлениюИзлишковКорректировка
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.ОстаткиИОбороты(, , Регистратор, , Склад = &Склад) КАК ТоварыКОформлениюИзлишков
	|ГДЕ
	|	(ВЫРАЗИТЬ(ТоварыКОформлениюИзлишков.Регистратор КАК Документ.КорректировкаРеализации)) = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор КАК Документ.ОрдерНаОтражениеИзлишковТоваров).бг_ДокументОснование КАК ДокументОснование,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Склад КАК Склад,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Назначение КАК Назначение,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Серия КАК Серия,
	|	СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовПриход) КАК КОформлениюАктовПриход
	|ПОМЕСТИТЬ ТоварыКОформлениюИзлишковОрдер
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.ОстаткиИОбороты(, , Регистратор, , ) КАК ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты
	|ГДЕ
	|	ВЫРАЗИТЬ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор КАК Документ.ОрдерНаОтражениеИзлишковТоваров).бг_ДокументОснование = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Склад,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Номенклатура,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Характеристика,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Серия,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Назначение,
	|	ВЫРАЗИТЬ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор КАК Документ.ОрдерНаОтражениеИзлишковТоваров).бг_ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлениюИзлишковКорректировка.Склад КАК Склад,
	|	ТоварыКОформлениюИзлишковКорректировка.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюИзлишковКорректировка.Характеристика КАК Характеристика,
	|	ТоварыКОформлениюИзлишковКорректировка.Назначение КАК Назначение,
	|	ТоварыКОформлениюИзлишковКорректировка.Серия КАК Серия,
	|	ТоварыКОформлениюИзлишковКорректировка.КОформлениюАктовРасход - ЕСТЬNULL(ТоварыКОформлениюИзлишковОрдер.КОформлениюАктовПриход, 0) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ТоварыКОформлениюИзлишковОстаток
	|ИЗ
	|	ТоварыКОформлениюИзлишковКорректировка КАК ТоварыКОформлениюИзлишковКорректировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыКОформлениюИзлишковОрдер КАК ТоварыКОформлениюИзлишковОрдер
	|		ПО (ТоварыКОформлениюИзлишковКорректировка.Регистратор = ТоварыКОформлениюИзлишковОрдер.ДокументОснование
	|				И ТоварыКОформлениюИзлишковКорректировка.Номенклатура = ТоварыКОформлениюИзлишковОрдер.Номенклатура
	|				И ТоварыКОформлениюИзлишковКорректировка.Характеристика = ТоварыКОформлениюИзлишковОрдер.Характеристика
	|				И ТоварыКОформлениюИзлишковКорректировка.Назначение = ТоварыКОформлениюИзлишковОрдер.Назначение
	|				И ТоварыКОформлениюИзлишковКорректировка.Серия = ТоварыКОформлениюИзлишковОрдер.Серия
	|				И ТоварыКОформлениюИзлишковКорректировка.Склад = ТоварыКОформлениюИзлишковОрдер.Склад)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КоличествоУпаковок,
	|	Склад,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлениюИзлишковОстаток.Склад КАК Склад,
	|	ТоварыКОформлениюИзлишковОстаток.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюИзлишковОстаток.Характеристика КАК Характеристика,
	|	ТоварыКОформлениюИзлишковОстаток.Назначение КАК Назначение,
	|	ТоварыКОформлениюИзлишковОстаток.Серия КАК Серия,
	|	ТоварыКОформлениюИзлишковОстаток.КоличествоУпаковок КАК Количество,
	|	ТоварыКОформлениюИзлишковОстаток.КоличествоУпаковок КАК КоличествоУпаковок
	|
	|ИЗ
	|	ТоварыКОформлениюИзлишковОстаток КАК ТоварыКОформлениюИзлишковОстаток
	|ГДЕ
	|	ТоварыКОформлениюИзлишковОстаток.КоличествоУпаковок > 0";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти
